Revit 2024 API
BuiltInFailures.MechanicalFailures Class
 Failures about HVAC.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class MechanicalFailures
Visual Basic
Public NotInheritable Class MechanicalFailures
Visual C++
public ref class MechanicalFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures
See Also
BuiltInFailures.MechanicalFailures Members
Autodesk.Revit.DB Namespace